# pymysql ÌÖåÏä§Ìä∏

In [2]:
import pymysql

In [3]:
# MySQL ÏÑúÎ≤ÑÏóê Ïó∞Í≤∞
conn = pymysql.connect(
    host='localhost', user='root', password='1234',  db='my_db',
    charset='utf8'   # ÌïúÍ∏ÄÏ≤òÎ¶¨ (charset = 'utf8‚Äô)
) 
conn

In [4]:
# Ïª§ÏÑú ÏÉùÏÑ±
cursor = conn.cursor()
cursor

In [5]:
sql_query = '''
    SELECT ENAME, SAL, JOB 
    FROM emp;
'''

cursor.execute(sql_query)
result = cursor.fetchall()
result

(('SMITH', Decimal('800.00'), 'CLERK'),
 ('ALLEN', Decimal('1600.00'), 'SALESMAN'),
 ('WARD', Decimal('1250.00'), 'SALESMAN'),
 ('JONES', Decimal('2975.00'), 'MANAGER'),
 ('MARTIN', Decimal('1250.00'), 'SALESMAN'),
 ('BLAKE', Decimal('2850.00'), 'MANAGER'),
 ('CLARK', Decimal('2450.00'), 'MANAGER'),
 ('SCOTT', Decimal('3000.00'), 'ANALYST'),
 ('KING', Decimal('5000.00'), 'PRESIDENT'),
 ('TURNER', Decimal('1500.00'), 'SALESMAN'),
 ('ADAMS', Decimal('1100.00'), 'CLERK'),
 ('JAMES', Decimal('950.00'), 'CLERK'),
 ('FORD', Decimal('3000.00'), 'ANALYST'),
 ('MILLER', Decimal('1300.00'), 'CLERK'),
 ('GOD', Decimal('8000.00'), 'PRO'))

In [6]:
# ÏøºÎ¶¨ Ïã§Ìñâ ÏòàÏãú
sql_query = """
    SELECT ENAME AS ÏÇ¨ÏõêÏù¥Î¶Ñ, 
    DNAME AS ÏÜåÏÜçÎ∂ÄÏÑúÏù¥Î¶Ñ, 
    SAL AS Í∏âÏó¨, 
    JOB AS ÏßÅÎ¨¥
    FROM emp e
    JOIN dept d ON e.DEPTNO = d.DEPTNO;
"""
cursor.execute(sql_query)

# ÏøºÎ¶¨ Í≤∞Í≥º Í∞ÄÏ†∏Ïò§Í∏∞
result = cursor.fetchall()

# Í≤∞Í≥º Ï∂úÎ†•
for row in result:
 print(row)

('CLARK', 'ACCOUNTING', Decimal('2450.00'), 'MANAGER')
('KING', 'ACCOUNTING', Decimal('5000.00'), 'PRESIDENT')
('MILLER', 'ACCOUNTING', Decimal('1300.00'), 'CLERK')
('SMITH', 'RESEARCH', Decimal('800.00'), 'CLERK')
('JONES', 'RESEARCH', Decimal('2975.00'), 'MANAGER')
('SCOTT', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ADAMS', 'RESEARCH', Decimal('1100.00'), 'CLERK')
('FORD', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ALLEN', 'SALES', Decimal('1600.00'), 'SALESMAN')
('WARD', 'SALES', Decimal('1250.00'), 'SALESMAN')
('MARTIN', 'SALES', Decimal('1250.00'), 'SALESMAN')
('BLAKE', 'SALES', Decimal('2850.00'), 'MANAGER')
('TURNER', 'SALES', Decimal('1500.00'), 'SALESMAN')
('JAMES', 'SALES', Decimal('950.00'), 'CLERK')

In [7]:
import pandas as pd
pd.DataFrame(result)

         0           1        2          3
0    CLARK  ACCOUNTING  2450.00    MANAGER
1     KING  ACCOUNTING  5000.00  PRESIDENT
2   MILLER  ACCOUNTING  1300.00      CLERK
3    SMITH    RESEARCH   800.00      CLERK
4    JONES    RESEARCH  2975.00    MANAGER
5    SCOTT    RESEARCH  3000.00    ANALYST
6    ADAMS    RESEARCH  1100.00      CLERK
7     FORD    RESEARCH  3000.00    ANALYST
8    ALLEN       SALES  1600.00   SALESMAN
9     WARD       SALES  1250.00   SALESMAN
10  MARTIN       SALES  1250.00   SALESMAN
11   BLAKE       SALES  2850.00    MANAGER
12  TURNER       SALES  1500.00   SALESMAN
13   JAMES       SALES   950.00      CLERK

In [8]:
# Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
cursor.close()
conn.close()

# MySQLdb

In [9]:
import MySQLdb

In [10]:
# MySQL ÏÑúÎ≤ÑÏóê Ïó∞Í≤∞ Ï†ïÎ≥¥
db_config = {
'host' :'localhost',  # Ìò∏Ïä§Ìä∏ Ïù¥Î¶Ñ
'user' : 'root',      # MySQL ÏÇ¨Ïö©Ïûê Ïù¥Î¶Ñ
'passwd' : '1234',    # MySQL ÏÇ¨Ïö©Ïûê ÎπÑÎ∞ÄÎ≤àÌò∏
'db' : 'my_db',       # Ïó∞Í≤∞Ìï† Îç∞Ïù¥ÌÑ∞Î≤†Ïù¥Ïä§ Ïù¥Î¶Ñ
'charset' : 'utf8'
}

In [11]:
try:
    conn = MySQLdb.connect(**db_config)  # Ïª§ÏÑú ÏÉùÏÑ±
    cursor = conn.cursor()               # ÏøºÎ¶¨ Ïã§Ìñâ ÏòàÏãú
    cursor.execute(sql_query)            # ÏøºÎ¶¨ Í≤∞Í≥º Í∞ÄÏ†∏Ïò§Í∏∞
    result = cursor.fetchall()           # Í≤∞Í≥º Ï∂úÎ†•
    for row in result:
        print(row)
except MySQLdb.Error as e:
    print(f"Error: {e}")
finally:                                 # Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
    cursor.close()
    conn.close()

('CLARK', 'ACCOUNTING', Decimal('2450.00'), 'MANAGER')
('KING', 'ACCOUNTING', Decimal('5000.00'), 'PRESIDENT')
('MILLER', 'ACCOUNTING', Decimal('1300.00'), 'CLERK')
('SMITH', 'RESEARCH', Decimal('800.00'), 'CLERK')
('JONES', 'RESEARCH', Decimal('2975.00'), 'MANAGER')
('SCOTT', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ADAMS', 'RESEARCH', Decimal('1100.00'), 'CLERK')
('FORD', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ALLEN', 'SALES', Decimal('1600.00'), 'SALESMAN')
('WARD', 'SALES', Decimal('1250.00'), 'SALESMAN')
('MARTIN', 'SALES', Decimal('1250.00'), 'SALESMAN')
('BLAKE', 'SALES', Decimal('2850.00'), 'MANAGER')
('TURNER', 'SALES', Decimal('1500.00'), 'SALESMAN')
('JAMES', 'SALES', Decimal('950.00'), 'CLERK')

# SQLAlchemy

In [12]:
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:1234@localhost/my_db")
df = pd.read_sql("SHOW TABLES IN my_db;", engine)
tables = pd.read_sql("SELECT * FROM dept", engine)
print(df)
tables

  Tables_in_my_db
0            dept
1             emp
2        salgrade

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [13]:
from sqlalchemy import create_engine, Column, Integer, String
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

In [14]:
# ORM Í∏∞Î≥∏ base ÌÅ¥ÎûòÏä§ ÏÉùÏÑ±
Base = declarative_base()

# products ÌÖåÏù¥Î∏î Ï†ïÏùò
class Product(Base):
    __tablename__ = 'products'

    id = Column(Integer, primary_key=True, autoincrement=True)
    name = Column(String(100), nullable=False)
    price = Column(Integer, nullable=False)
    stock = Column(Integer, nullable=False)

    def __repr__(self):
        return f"<Product(id={self.id}, name='{self.name}', price={self.price}, stock={self.stock})>"

# ÌÖåÏù¥Î∏î ÏÉùÏÑ±
Base.metadata.create_all(engine)

C:\Users\Admin\AppData\Local\Temp\ipykernel_3288\2262866718.py:2: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()

In [15]:
Session = sessionmaker(bind=engine)
session = Session()

In [ ]:
# CREATE: ÏÉÅÌíà Îì±Î°ù

def add_product(name, price, stock):
    new_product = Product(name=name, price=price, stock=stock)
    session.add(new_product)       # insert
    session.commit()
    print(f"üÜï '{name}' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!")


add_product("Î°§Î¶¨Ìåù", 500, 10)
add_product("Ìï´Ï¥àÏΩî", 2000, 10)

üÜï 'Î°§Î¶¨Ìåù' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!
üÜï 'Ìï´Ï¥àÏΩî' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!

In [17]:
# READ: ÏÉÅÌíà Ï°∞Ìöå

def list_products():
    products = session.query(Product).all()
    for p in products:
        print(p)

list_products()

<Product(id=1, name='Î°§Î¶¨Ìåù', price=500, stock=10)>
<Product(id=2, name='Ìï´Ï¥àÏΩî', price=2000, stock=10)>

In [18]:
# UPDATE: Í∞ÄÍ≤© ÏàòÏ†ï

def update_price(product_id, new_price):
    product = session.query(Product).get(product_id)
    if product:
        product.price = new_price
        session.commit()
        print(f"üí∏ {product.name}Ïùò Í∞ÄÍ≤©Ïù¥ {new_price}ÏõêÏúºÎ°ú Î≥ÄÍ≤ΩÎêòÏóàÏäµÎãàÎã§.")
    else:
        print("‚ùå Ìï¥Îãπ ÏÉÅÌíàÏù¥ Ï°¥Ïû¨ÌïòÏßÄ ÏïäÏäµÎãàÎã§.")

update_price(2, 3000)

üí∏ Ìï´Ï¥àÏΩîÏùò Í∞ÄÍ≤©Ïù¥ 3000ÏõêÏúºÎ°ú Î≥ÄÍ≤ΩÎêòÏóàÏäµÎãàÎã§.

C:\Users\Admin\AppData\Local\Temp\ipykernel_3288\3595867915.py:4: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(product_id)

In [20]:
# DELETE: ÏÉÅÌíà ÏÇ≠Ï†ú

def delete_product(product_id):
    product = session.query(Product).get(product_id)
    if product:
        session.delete(product)
        session.commit()
        print(f"üóëÔ∏è '{product.name}' ÏÉÅÌíàÏù¥ ÏÇ≠Ï†úÎêòÏóàÏäµÎãàÎã§.")
    else:
        print("‚ùå Ìï¥Îãπ ÏÉÅÌíàÏù¥ Ï°¥Ïû¨ÌïòÏßÄ ÏïäÏäµÎãàÎã§.")
        
delete_product(3)

‚ùå Ìï¥Îãπ ÏÉÅÌíàÏù¥ Ï°¥Ïû¨ÌïòÏßÄ ÏïäÏäµÎãàÎã§.

C:\Users\Admin\AppData\Local\Temp\ipykernel_3288\931701714.py:4: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(product_id)

In [ ]:
# ÏÑ∏ÏÖòÏùò Î∞òÎÇ©

try:
    # ÏûëÏóÖ
    product = session.query(Product).get(1)
    product.price += 500
    session.commit()
except Exception as e:
    session.rollback()
    print("ÏòàÏô∏ Î∞úÏÉù, Î°§Î∞±:", e)
finally:
    session.close()
    print("ÏÑ∏ÏÖò Ï¢ÖÎ£å")